if __name__ == '__main__':

    # кодировка алфавита
    d = {
        '62': 'А', '61': 'а', '60': 'Б', '59': 'б', '58': 'В', '57': 'в',
        '56': 'Г', '55': 'г', '54': 'Д', '53': 'д', '52': 'Ж', '51': 'ж',
        '50': 'З', '49': 'з', '48': 'И', '47': 'и', '46': 'Й', '45': 'й',
        '44': 'К', '43': 'к', '42': 'Л', '41': 'л', '40': 'М', '39': 'м',
        '38': 'Н', '37': 'н', '36': 'О', '35': 'о', '34': 'П', '33': 'п',
        '32': 'Р', '31': 'р', '30': 'С', '29': 'c', '28': 'Т', '27': 'т',
        '26': 'У', '25': 'у', '24': 'Ф', '23': 'ф', '22': 'X', '21': 'x',
        '20': 'Ц', '19': 'ц', '18': 'Ч', '17': 'ч', '16': 'Ш', '15': 'ш',
        '14': 'Щ', '13': 'щ', '12': 'Ъ', '11': 'ъ', '10': 'Ы', '9': 'ы',
        '8': 'Ь', '7': 'ь', '6': 'Э', '5': 'э', '4': 'Ю', '3': 'ю',
        '2': 'Я', '1': 'я'
    }

    # Дешифровка
    frase = input('Введите фразу: ')
    coding_frase = ""
    for j in frase:
        for i in d.keys():
            if str(j) in d.get(i):
                coding_frase += i + " "
    print(coding_frase)

    # Расшифровка
    frase_1 = input('Введите фразу в цифрах через пробелы: ')
    coding_frase_1 = ""
    for j in frase_1.split(" "):
        for i in d.keys():
            if str(j) == str(i):
                coding_frase_1 += d.get(i) + " "
    print(coding_frase_1)

